{
  "Metadata": {
    "title": "Portfolio | Benny Nobre - Full-Stack Developer",
    "description": "Portfolio of Benny Lucas Nobre de Almeida, a Full-Stack Developer specializing in Angular, React, Next.js, Node.js, and Java."
  },
  "Navbar": {
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Contact"
  },
  "AboutMe": {
    "title": "About Me",
    "description": "<p>Full-Stack Developer who loves building and understanding how things work, from the robust back-end to the interactive interface.</p><p>My journey in tech began with curiosity, which quickly evolved into a passion for programming. My desire to understand the \"bigger picture\" naturally led me to Full-Stack development.</p><p>Currently, I work at <b>LAB LDI</b>, where I collaborate on developing a highly responsive and interactive website focused on accessibility for visually impaired people. My day-to-day work is focused on <b>Angular</b> and <b>Java</b>, delivering high-quality, maintainable solutions.</p><p>In parallel, I dedicate my time to exploring and building personal projects with <b>React, Next.js, and Node.js</b>, always keeping up-to-date with the latest trends in the JavaScript ecosystem.</p>",
    "downloadButton": "Download Resume",
    "CurriculumUrl": "/Curriculum_BENNY-EN.pdf"
  },
  "Projects": {
    "title": "My Projects",
    "valorant-tracker": {
      "title": "Valorant Tracker",
      "description": "A Valorant stats tracker featuring a performance dashboard, match history, and agent analysis."
    },
    "portfolio-v1": {
      "title": "Personal Portfolio v1",
      "description": "My previous personal portfolio, built to learn the fundamentals of HTML and CSS."
    }
  },
  "Experience": {
    "title": "Experience & Education",
    "lab-ldi": {
      "role": "Full-Stack Developer",
      "entity": "LAB LDI",
      "dateStart": "NOV 2023",
      "dateEnd": "PRESENT",
      "description": "<p>I develop and maintain a website focused on accessibility, ensuring visually impaired individuals can access learning courses. My daily work involves a microservices architecture with <b>Java</b> and building interactive interfaces with <b>Angular</b>.</p>"
    },
    "grupo-escalada": {
      "role": "Junior Front-End Developer",
      "entity": "Grupo Escalada | e-commerce",
      "dateStart": "JUN 2023",
      "dateEnd": "SEP 2023",
      "description": "<p>I actively participated in the development of an e-commerce site, following the SCRUM methodology. I was responsible for building reusable UI components using <b>React.js</b>, <b>Next.js</b>, and <b>Tailwind CSS</b>, and collaborated on integrating the front-end with the <b>Node.js</b> back-end.</p>"
    },
    "dell-lead": {
      "role": "Web Developer",
      "entity": "Dell Lead",
      "dateStart": "JUN 2022",
      "dateEnd": "FEB 2023",
      "description": "<p>AppTalk Project: I developed an innovative application to mediate interaction between users with hearing and auditory impairments. The challenge involved integrating complex libraries like <b>MediaPipe</b> (for AI) and <b>Three.js</b> (for 3D) into a <b>React</b> application, all orchestrated with <b>Nest.js</b> and <b>RabbitMQ</b>.</p>"
    },
    "devindev": {
      "role": "Front-End Developer",
      "entity": "DevInDev - Freelancer",
      "dateStart": "N/A",
      "dateEnd": "N/A",
      "description": "<p>Developed a complete landing page for the SouElo project. I was responsible for the entire lifecycle, from setting up the environment with <b>Docker</b> to delivering the interface in <b>React.js</b> and <b>Next.js</b>.</p>"
    },
    "unifor": {
      "role": "Higher Degree in Systems Analysis and Development",
      "entity": "University of Fortaleza (UNIFOR)",
      "dateStart": "JUL 2024",
      "dateEnd": "Est. DEC 2026",
      "description": "<p>Higher education focused on software analysis and development.</p>"
    }
  },
  "Contact": {
  "title": "Get in Touch",
  "description": "I'm always open to discussing new projects, work opportunities, or just to chat. Feel free to reach out!",
  "linkedin": "LinkedIn",
  "github": "GitHub",
  "emailCopy": "Copy Email",
  "emailCopied": "Email Copied!"
  },
  "Footer": {
    "copyright": "© {year} Benny Nobre. All rights reserved."
  },
  "Tooltips": {
    "github": "GitHub",
    "linkedin": "LinkedIn",
    "theme": "Switch Theme",
    "language":"Switch Language"
  }
}